<template>
  <div class="productSearch">
    <h1 class="title">Как выбрать адекватного иностранного поставщика нужного вам товара?</h1>
    <article-nav v-if="innerWidth < 600" :headers="headers" :currentSection="currentSection" />
    <hr class="hr"/>

    <article class="article">
      <h2 class="article__title" :id="headers[0]">Где искать</h2>
      <p class="article_text">
         Самый крупный мировой сайт производителей в Азии – это Alibaba.com
        <a 
        href="https://www.alibaba.com/" 
        class="article_text link"
        target="blank"
        >https://www.alibaba.com/</a>
      </p>
      <p class="article_text">
        Сайт выглядит как привычный маркетплейс, в поисковую строку можно ввести наименование товара и вставить картинку, а можно просто входить в меню категорий товаров и там выбирать, если у вас нет определенного запроса.
      </p>
      <p class="article_text">
        Для того, чтобы можно было общаться с поставщиками товаров, необходимо зарегистрироваться – стандартная процедура как на любых других сайтах.
      </p>
      <img class="article__img" src="@/assets/images/alibaba.png" alt="alibaba">
    </article>

    <article class="article">
      <h2 class="article__title" :id="headers[1]" > Поиск товара на сайте </h2>
      <p class="article_text">
        Приступаем к поиску. Например, вам нужны крутые бейсболки с LED подсветкой.
      </p>
      <ul class="article__ul">
        <li class="article_text">
          Забиваем в поисковой строке сайта «Baseball cap with LED».
        </li>
        <li class="article_text">
          Слева на странице есть фильтры, по которым мы можем уточнять свой поиск. Например, выбрать тип кепки, максимальный тираж, который вы готовы привезти и страну, откуда бы хотели импортировать.
        </li>
        <li class="article_text">
          После того, как вы настроили поиск, теперь можно изучать предлагаемые варианты. Вся самая важная информация вынесена справа от фото товара.
        </li>
      </ul>
    </article>

    <article class="article">
      <h2 class="article__title" :id="headers[2]">На что обратить внимание при выборе</h2>
      <ul class="article__ul">
        <li class="article_text">
        <b class="article_text bold">Главная картинка.</b> Формально, на ней кепка с подсветкой. НО! Вы хотели 5-ти клинную кепку, а на фото 6 клиньев. Вы хотели с прямым козырьком, а на фото изогнутый. Вам нужна подсветка края всего козырька, а на фото 1 диод светит точечно. Помните, что под одно и тоже описание могут попадать разные изделия, поэтому внимательно изучайте фото в карточке товара.
        </li>
        <li class="article_text">
          <b class="article_text bold">Цена.</b>Указана цена товара, без учета доставки и таможенного оформления.
        </li>
        <li class="article_text">
          <b class="article_text bold">Тираж.</b> Указан минимальный тираж заказа – в штуках, кг, метрах и прочих единицах измерения.
        </li>
        <li class="article_text">
          <b class="article_text bold">Рейтинг продавца.</b> Указано, сколько времени продавец ведет свою деятельность на сайте (чем дольше, тем лучше и серьёзнее производитель), а также его рейтинг на основании оценок покупателей. 5-балльная шкала и количество отзывов. Это основные критерии, по которым можно определить быстро, насколько товар вам подходит. Если поставщику 1 год на сайте, цена дешевле всех, минимальный заказ маленький и оценка ниже 3, пролистывайте смело дальше и ищите более подходящий вариант.
        </li>
      </ul>
    </article>

    <article class="article">
      <h2 class="article__title" :id="headers[3]">Общение с поставщиком</h2>
      <p class="article_text">
        Если вы убедились, что перед вами нужны товар и вроде бы адекватный продавец, нужно отправить ему запрос, чтобы получить коммерческое предложение (Quоtation).
      </p>
      <p class="article_text">
        Нажимаете кнопку Contact supplier и запрашиваете необходимую вам информацию.
      </p>
      <img class="article__img" src="@/assets/images/documentation/image2.png" alt="Общение с поставщиком">
      <p class="article_text">
        Помимо описания товара, который вам нужен, например, Розовый халатик как у продавца, но с перламутровыми пуговицами, вам необходимо также указать какая упаковка вам понадобится, нужно ли будет брендирование халатика и прочие требования именно к товару. Другими словами – Техническое Задание, по которому производитель сможет рассчитать для вас цену изделия. НО! Это будет только цена изделия, помните об этом!
      </p>
      <p class="article_text">
        Помимо стоимости самого товара, вам необходимо узнать у производителя или продавца:
      </p>
      <ul class="article__ul">
        <li class="article_text">
          его габариты для расчёта логистики;
        </li>
        <li class="article_text">
          полное описание (спецификация – состав, размеры, функционал, если он есть, назначение и применение). Это очень важно! От этого зависит к какому коду ТНВЭД будет относится ваш товар. От кода зависит размер таможенной пошлины, НДС и необходимость получения разрешительных документов на ввоз вашей продукции (сертификация);
        </li>
        <li class="article_text  border">
         <b  class="article_text bold">Простой пример:</b> Простой пример: Халат может быть из натуральных тканей, а может быть синтетическим. Он может быть мужской рабочий или женский медицинский, а может быть и детский халат для творчества, или банный, или одноразовый из нетканного материала! Всё это халаты, но абсолютно разные коды и пошлины.
        </li>
        <li class="article_text">
          запросите сроки на образец по вашим характеристикам и его стоимость (чтобы заложить это в затраты);
        </li>
        <li class="article_text">
          запросите сроки на изготовление вашего тиража, так вы сможете в дальнейшем понимать какой вид доставки (авиа, авто, жд или море) использовать, чтобы получить товар к нужному сроку;
        </li>
        <li class="article_text">
          попросите указать срок действия коммерческого предложения (на многие виды изделий цена очень зависит от цен на нефть);
        </li>
        <li class="article_text">
          вы можете также в запросе приложить свой лого, или эскиз, или фото.
        </li>
      </ul>
        <img class="article__img" src="@/assets/images/documentation/image3.png" alt="образец письма поставщику">
        <p class="article_text">
          Разница во времени с Китаем 5 часов, если вы находитесь в центральной части России, поэтому желательно все ваши запросы отправить до 10 часов утра, если вы хотите получить ответ в этот же день. Отправляйте запросы сразу на 10 подходящих фабрик или продавцов, воронка есть и тут 😁. Не все 10-15 фабрик вам ответят, кто-то ответит полную чушь, кто-то невнимательно читал ваш запрос и будет тратить ваше время на выяснение деталей, а кто-то помимо ответа на ваш запрос пришлёт ещё и каталог с продукцией фабрики и предложит более выгодный вариант (красавчики!).
        </p>
        <p class="article_text">
          Стандартный ответ выглядит так: дружественное приветствие, краткое описание фабрики и специализации, приложение с коммерческим предложением, которое нужно изучить на предмет полноты информации. Всё ли указали в Quotation, что нам нужно для дальнейшего расчета стоимости товара уже в РФ (с доставкой, таможней и сертификацией).
        </p>
        <img class="article__img" src="@/assets/images/documentation/image4.png" alt="образец ответа поставщика">
        <img class="article__img" src="@/assets/images/documentation/image5.png" alt="образец ответа поставщика">
        <p class="article_text">
          Здесь достаточно информации для расчета стоимости минимальной партии заказа (Minimal Order Quantity, сокращенно MOQ) и указана стоимость за единицу, на условиях отгрузки FOB (продавец довезет товар до порта выхода), а также доставки (указано сколько штук в коробке, объём и вес коробки). Однако не указано время производства образца и тиража, а также срок действия КП. Необходимо всё-так уточнить эту информацию, чтобы учесть и расходы, и сроки поставки, и возможность изменения цены, если вы не в этом же моменте будете размещать ваш заказ.
        </p>
    </article>

    <article class="article">
      <h2 class="article__title" :id="headers[4]">Зачем нужна подробная информация о товаре</h2>
      <p class="article_text">
        На основании габаритов товара, вы сможете рассчитать общую массу и объем вашего товара, чтобы сделать запрос логисту. Логист рассчитает стоимость доставки от места забора груза до дверей вашего склада.
      </p>
      <p class="article_text">
        На основании стоимости товара, его назначения, функционала и области применения, брокер сможет рассчитать ваши таможенные платежи, которые уплачивает каждый импортёр при ввозе товара из других стран. Брокер подготовит таможенную декларацию по вашему грузу и будет «переводчиком» между вами и таможенным органом. Вы, как импортёр, можете сами задекларировать ваш товар, но желательно для этого закончить Таможенную Академию и получить диплом 😅. В 95% случаев импортные грузы декларируются через таможенного брокера – вашего представителя в таможне по договору, остальные 5% - это дипломированные специалисты, которые работают в штате компании, если у вас более 10-15 контейнеров в неделю.
      </p>
      <p class="article_text">
        Ещё брокер вам сообщит, если ваш груз является опасным или нет, какие нужны разрешительные документы. Посоветует, куда можно обратиться за получением сертификатов по вашему виду товара и какая будет процедура. А может случится и такое, что товар, который вы нашли может быть запрещен к ввозу в нашу страну из-за состава, или действующих санкций, или из-за назначения.
      </p>
     
    </article>

    <article class="article">
      <h2 class="article__title" :id="headers[5]">Практические советы</h2>
      <ul class="article__ul">
        <li class="article_text">
          <b class="article_text bold">Выясните сразу, кто перед вами: фабрика или торговый агент.
          </b>Старайтесь работать с фабриками напрямую, меньше рисков быть неверно понятыми, да и сократите сроки заказа. Работать без передастов выходит эффективнее!
        </li>
        <li class="article_text">
          <b class="article_text bold">Узнайте, какая площадь фабрики, сколько персонала и сколько производственных линий.</b>Если у вас маленький заказик, а производство огромное, то есть риск, что вам придётся ждать пока вас поставят в очередь, или что минимальная партия для этого производства сильно превышает ваш заказ. Тогда вам лучше найти фабрику поменьше. Обратная ситуация - вы нашли уютную семейную мануфактуру, а вам нужен ОГРОМНЫЙ ТИРАЖ и в сжатые сроки. С таким объёмом могут не справиться. Чтобы не тратить своё время на пустые переговоры и выяснения, вы можете отбросить сразу неподходящие варианты.
        </li>
        <li class="article_text">
          <b class="article_text bold">Посмотрите, сколько лет поставщик присутствует на рынке.</b>
           Это показатель стабильности и профессиональности: чем больше лет, тем лучше! Мы работаем с компаниями, которым не меньше 5 лет, в любой стране.
        </li>
        <li class="article_text">
          <b class="article_text bold">Обратите внимание, насколько быстро и полно отвечает потенциальный поставщик на ваши запросы.</b>Мы подготавливаем письмо из описания задачи, 5 важных пунктов, прикладываем ТЗ, и пуляем 15 поставщикам интересующего нас товара. Если на следующий день мы не получили полноценного QUOTATION (коммерческое предложение), то потом нам писать бесполезно. Даже если это был выходной. Если получен ответ, но там нет ответов по всем 5 пунктам, то и на это никто не теряет своё драгоценное ВРЕМЯ - ответ летит в корзину! Если получили ответ, где расписаны все 5 пунктов и ещё 2 дополнительных, если ещё прислали фото вариантов исполнения и других моделей, возможную упаковку, и нашли нашего менеджера в WeChat, то нам есть о чём дальше разговаривать.
        </li>
        <li class="article_text">
          <b class="article_text bold"> Не ленитесь читать отзывы других покупателей о поставщике, в разных источниках.</b>
        </li>
      </ul>     
    </article>

    <div class="banner">
      <p class="banner__text">
        Теперь вы знаете, как найти поставщика! <br> Желаем удачных поставок 😉
      </p>
    </div>

    <service-details-sm 
      :title="'Поиск товара'"
      :btn="'Заказать поиск'" 
      :price="'3000 ₽'" 
      class='serviceDetailsSm'
    >
      <template v-slot:header >
        <div class="slot-row">
          <img class="icon" v-if="innerWidth > 600" src="@/assets/images/home_page/magnify.png" alt="поиск">
          <img class="icon" v-else src="@/assets/images/home_page/magnifying_glass_mobile.png" alt="поиск">
          <p class="text">Поиск товара по заданным параметрам</p>
        </div>
        <div class="slot-row">
          <img class="icon" v-if="innerWidth > 600" src="@/assets/images/home_page/stars.png" alt="stars">
          <img class="icon" v-else src="@/assets/images/home_page/stars_mobile.png" alt="stars">
          <p class="text">Вы получите 3 предложения от лучших поставщиков</p>
        </div>
      </template>
      <template v-slot:footer>
        <p class="text">Для тех, кто хочет найти товар и дорожит свои временем</p>
      </template>
    </service-details-sm>

    <my-dialog v-if="DIALOG">
      <signin-offer-form v-if="BTN_ID === 'signin_offer'" />
    </my-dialog>

  </div>
</template>

<script>
  import SigninOfferForm from "@/components/Form/SigninOfferForm"
  import ServiceDetailsSm from '../HomePage/ServiceDetailsSm.vue'
  import ArticleNav from './ArticleNav.vue'
  import { mapGetters } from "vuex"
  export default {
    name: 'product-search',
    components:{ServiceDetailsSm, ArticleNav, SigninOfferForm},
    props:{
      headers:{
        type: Array,
      }, 
      currentSection: String,
    },

    data() {
      return {
        innerWidth: window.innerWidth
      }
    },

    computed: {
      ...mapGetters(["BTN_ID", "DIALOG"])
    }
    
  }
</script>

<style lang="scss" scoped>


.link{
  color: $main-color !important;
}

.slot-row{
  @include flex(row, flex-start, center, 20px);
  margin-bottom: 10px;
  height: 36px;
}

.text{
  @include font(14px, 500, #416782);
  line-height: 21px;
  text-align: left;
}
.banner{
  height: 180px;
  border-top: 2px solid #D9E1E7;
  border-bottom: 2px solid #D9E1E7;
  @include flex(row, center, center, 0);
  margin-bottom: 120px;

  .banner__text{
    @include font(20px, 600, $font-color2);
    line-height: 30px;
  }
}
.article__img{
  margin: 20px 0;
  width: 100%;
}

.border{
  list-style-type: none;
  border: 2px solid #D9E1E7;
  border-radius: 10px;
  padding: 20px 30px;
}

.productSearch{
  max-width: 600px;
}
  .title{
    text-align: left;
    @include font(32px, 600, $font-color2);
    line-height: 38px;
    margin: 0;

    @media (max-width: 600px) {
      @include font(20px, 600, $font-color2);
      line-height: 27px;
    }
  }

  .hr{
    margin: 60px 0;

    @media (max-width: 600px) {
      display: none;
    }

  }
  .article{
    @include flex(column, center, flex-start, 0px);
    margin-bottom: 60px;

    @media (max-width: 600px) {
      margin-bottom: 45px;
    }
  }
  .article__title{
    @include font(20px, 600, $font-color2);
    line-height: 23px;
    margin-bottom: 20px !important;
    margin: 0;
    text-align: left;

    @media (max-width: 600px) {
      @include font(17px, 600, $font-color2);
      line-height: 23px;
      
    }
  }
  .article_text{
    @include font(17px, 500, #416782 );
    line-height: 26px;
    text-align: left;
    margin-bottom: 20px;

    @media (max-width: 600px) {
      @include font(14px, 500, #416782);
      line-height: 19px;
    }

  }

  .bold{
    font-weight: bold;
  }

  .article__ul{
    padding-left: 20px;
  }

</style>