<template>
  <div class="wrapper">
    <h1 class="title">ОФЕРТА СЕРВИСА «delegat.online»</h1>
    <div class="subTitle">(редакция от «01» января 2023 г.)</div>
    <h2 class="title">ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ</h2>
    <p class="text">
      В целях настоящего документа нижеприведенные термины используются в следующем значении:
      <br><br>
      <span>- «Оферта»</span> — настоящий документ, являющийся договором-офертой, то есть публичным предложением любому лицу заключить Договор на условиях, изложенных ниже, включая все сопутствующие Оферте документы и приложения, разработанные Агрегатором и размещенные для ознакомления на Сайте. Настоящий документ также является Пользовательским соглашением, регулирующим технический порядок взаимодействия Агрегатора и Пользователя.
      <br><br>
      <span>- «Договор» </span>– означает настоящий Договор, заключенный между Сторонами в результате Акцепта Пользователем Оферты, наделяющий Агрегатора и Пользователя правами и обязанностями, указанными в настоящей Оферте. Любая ссылка в настоящей Оферте на Договор (статью Договора) и / или его условия означает соответствующую ссылку на настоящую Оферту и / или ее условия. 
      <br><br>
      <span>- «Акцепт»</span> — совершение Пользователем действий, указанных в настоящей Оферте, свидетельствующих о принятии данным лицом условий Оферты в полном объеме, в том числе, совершении действий по выполнению указанных в настоящей Оферте условий;
      <br><br>
      <span>- «Агрегатор»</span> – Общество с ограниченной ответственностью «ДЕЛЕГАТ», ИНН 7714476990, ОГРН 1217700470657, обеспечивающее информационно-технологическое сопровождение взаимодействия между Пользователями (Заказчиками) и Исполнителями;
      <br><br>
      <span>- «Пользователь / Заказчик» </span>– лицо, заключившее Договор с Исполнителем в результате Акцепта Оферты в электронной форме, путем совершения конклюдентных действия и / или путем подписания соответствующего соглашения в бумажном виде и в полном объеме выполняющий свои обязательства по Договору.
      <br><br>
      <span>- «Авторизованный пользователь / Авторизированный заказчик»</span> — Пользователь, авторизовавшийся на Сервисе с помощью логина и пароля, присвоенных ему при регистрации;
      <br><br>
      <span>- «Исполнитель»</span> — лицо, реализующее работы и услуги Пользователям в области таможенного оформления, логистики и грузоперевозок, а также комплекса сопутствующих услуг (либо агент/комиссионер/иной представитель указанного лица);
      <br><br>
      <span>- «Заказ»</span> — оформленный Пользователем на Сервисе заказ соответствующей услуги у Исполнителя и / или Агрегатора, в результате которого Заказчик намеревается заключить соответствующий договор с Исполнителем в порядке, предусмотренном настоящей Офертой, а также в строгом соответствии с образцом договора, приведенным Агрегатором на Сервисе;
      <br><br>
      <span>- «Сервис «Delegat»</span> — означает все веб-сайты (включая, но не ограничиваясь), размещенными в сети Интернет по адресу: https://delegat.online, программы для ЭВМ, иные программы для мобильных устройств, предоставляющие Пользователю Сервиса возможность осуществить Заказ на условиях, предусмотренных в настоящей Оферте.
      <br><br>
      <span>- «Сайт» </span>– информационная площадка Агрегатора, расположенная в сети Интернет по адресу delegat.online
      <br><br>
      <span>- «Регистрация на сайте»</span> — процедура для Пользователя, которая позволяет внести в базу данных сведения о Пользователе и предоставлении права пользования Сервисом. При прохождении процедуры регистрации Пользователь указывает достоверную информацию о себе, а также необходимую информацию для подтверждения регистрации и дальнейшее использование Сайта.
      Термины, не указанные выше, соответствуют терминам, указанным в Гражданском Кодексе Российской Федерации, а в случае отсутствия в нём какого-либо термина – обычаям и терминам, применяемым при аналогичных правоотношениях в аналогичной ситуации.
    </p>
    <br><br>

    <h2 class="title">1. ОБЩИЕ ПОЛОЖЕНИЯ</h2>
    <p class="text">
      1.1. Настоящая Оферта разработана в целях информирования потенциальных Пользователей Сервиса о способах акцепта настоящей Оферты, ее исполнения и иных деталях, касающихся взаимодействия с Исполнителями, представленными на Сервисе, и получения реализуемых ими услуг.
      <br><br>
      1.2. Конкретные детали связанные с процессом оформления Заказа, условиями приобретения реализуемых Исполнителями услуг, стоимостью и иными деталями могут сообщаться Агрегатором Пользователю с использованием Электронной корреспонденции: путем направления соответствующего уведомления на контактный e-mail и / или сообщений в мессенджерах на контактный номер телефона Пользователя. При этом Пользователь обязан самостоятельно и заблаговременно проверять получение уведомлений, исходящих от Агрегатора. При этом, достоверными и полными адресами контактного e-mail адреса и / или контактного номера телефона Пользователя считаются те адреса, которые указаны Пользователем при регистрации и акцепте Оферты и / или предоставленные Пользователем Агрегатору в дальнейшем путем использования функционала Сервиса.
      <br><br>
      1.3. Заключение  Пользователем настоящего Договора осуществляется альтернативно путем совершения одного или нескольких следующих действий (акцепт публичной оферты):
      <br><br>
      1.3.1. Подача заявки путем активации поля такого типа как «Далее» или иного, аналогичного ему по функциональному назначению путем проставления знаков «V» напротив граф такого типа как «Я согласен с договором / офертой», «Я согласен с политикой в области обработки персональных данных», «Я даю согласие на обработку персональных данных»;
      <br><br>
      1.3.2. Совершение конклюдентных действий, свидетельствующих о принятии Оферты, в частности (но не ограничиваясь): заключение Пользователем договора с Исполнителем по форме, предусмотренной Сервисом и / или приобретение дополнительных услуг Агрегатора и внесение оплаты за такие услуги.
      <br><br>
      1.3.3. Подписание Заявления о присоединении к Оферте по форме приложения № 1 к настоящей Оферте.
      1.3.4. Заключая Договор любым из вышеуказанных способов, Пользователь подтверждает, что а) полностью ознакомился с положениями Оферты и сопутствующих документов, б) полностью понимает Оферту и сопутствующие документы в) полностью понимает значение и последствия своих действий в отношении заключения и исполнения Договора.
      <br><br>
      1.4. Настоящий Договор считается заключенным и вступает в силу для Сторон с даты Акцепта Оферты. Начиная использовать Сервис / его отдельные функции, Пользователь считается акцептовавшим Оферту, а также условия сопутствующих документов, в полном объеме, без всяких оговорок и исключений. В случае несогласия Пользователя с какими-либо из положений Оферты и / или регулирующих документов, Пользователь не вправе использовать Сервис.
      <br><br>
      1.5. Акцептуя условия Оферты, Пользователь дает согласие на обработку Агрегатором предоставленной им информации и (или) его персональных данных в соответствии с действующим законодательством РФ и политикой обработки персональных данных, размещенной Агрегатором на его Сайте. Обработка персональных данных совершается с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных с целью выполнения Агрегатором своих обязательств принятых по условиям настоящего Договора, иных обязательств, предусмотренных Договором. Пользователь подтверждает свое согласие с тем, что персональная информация, которую Пользователь предоставляет Агрегатору при использовании Сервиса, в том числе при оформлении Заказа, может быть передана Агрегатором Исполнителю, с которым Пользователь намеревается заключить Договор в результате оформления Заказа. 
      <br><br>
      1.6. Пользователь понимает и соглашается с тем, что в силу того, что данный документ в первую очередь является Офертой, то есть юридическим документом, полный фактический порядок взаимодействия между Агрегатором, Пользователем и Исполнителем, все технические и фактические детали отображаются Исполнителем на Сервисе путем оформления его функционала таким образом, чтобы любому Пользователю был интуитивно понятен процесс совершения того или иного действия на Сайте. В случае, если Пользователю не до конца понятен процесс взаимодействия и / или совершения того или иного действия, он обязуется в первую очередь обратиться к Агрегатору за соответствующими разъяснениями перед тем, как совершать такое действие. В случае, если Пользователь не осуществил соответствующий запрос и в дальнейшем совершил какое-либо действие, он не вправе предъявлять Агрегатору какие-либо претензии, так как Пользователь самостоятельно отказался от предоставленного права запросить соответствующие разъяснения.
    </p>
    <br><br>

    <h2 class="title">2. ПРЕДМЕТ ДОГОВОРА, ПОРЯДОК И УСЛОВИЯ ОФОРМЛЕНИЯ ЗАКАЗА НА СЕРВИСЕ</h2>
    <p class="text">
      2.1. Предметом настоящей Оферты является предоставление Агрегатором Пользователю услуг по доступу к Сервису и его использованию для осуществления поиска Исполнителей, реализующих услуги в области таможенного оформления, логистики и грузоперевозок. 
      <br><br>
      2.2. Агрегатор оказывает информационные услуги по предоставлению доступа к Сервису с целью обеспечения возможности получения информации Пользователями о Исполнителях, оказывающих вышеуказанные услуги. Продолжая использовать Сервис, Пользователь понимает и соглашается с тем, что все услуги, приобретенные с помощью размещения Заказа на Сервисе выполняются не Агрегатором, а третьими лицами – Исполнителями, с которыми Пользователи непосредственно заключают соответствующий договор по форме, предусмотренной функционалом Сервиса. Агрегатор является исключительно связующим звеном и оказывает лишь вышеуказанные информационные услуги по доступу к Сервису, а также сопутствующие дополнительные услуги, размещенные в предложении Агрегатора на Сервисе, которые Пользователи обязуются оплатить в соответствии с ценами, установленными Агрегатором и действующими на момент обращения к Агрегатору.
      <br><br>
      2.3. Использование отдельных функций Сервиса, в том числе оформление Заказа доступно Авторизованным пользователям после прохождения регистрации и авторизации на Сервисе. До момента оформления Заказа соответствующей услуги на Сервисе, Пользователь обязуется ознакомиться со всеми условиями настоящей Оферты. 
      <br><br>
      2.3.1. При регистрации Пользователь обязуется предоставить данные о себе, запрашиваемые на Сервисе в форме регистрации. Пользователь обязуется не передавать логин и пароль, присвоенные ему при регистрации, третьим лицам, а также обеспечивать сохранность и конфиденциальность логина и пароля. Пользователь самостоятельно несет ответственность за безопасность (устойчивость к угадыванию) выбранного им пароля, а также самостоятельно обеспечивает конфиденциальность своего пароля. Пользователь самостоятельно несет ответственность за все действия (а также их последствия) в рамках или с использованием Сервиса под учетной записью Пользователя. При этом все действия в рамках или с использованием Сервиса под учетной записью Пользователя считаются произведенными самим Пользователем, за исключением случаев, когда Пользователь, уведомил Агрегатора о несанкционированном доступе к Сервису с использованием учетной записи Пользователя и / или о любом нарушении (подозрениях о нарушении) конфиденциальности своего пароля.
      <br><br>
      2.4. Пользователь после оформлении Заказа и в случае достижения соответствующих договоренностей с Исполнителем заключает соответствующий договор в порядке, предусмотренном настоящей Офертой и вступает в прямые договорные отношения с Исполнителем в части реализации услуг. Использование собственных шаблонов договоров и / или внесение изменений в представленный Агрегатором шаблон без предварительного письменного согласования с ним не допускается и является существенным нарушением Договора.
      <br><br>
      2.5. Все права и обязательства по заключаемому Пользователем Договору (Договорам) возникают непосредственно у Исполнителя, а не у Агрегатора.
    </p>
    <br><br>

    <h2 class="title">3. ПОРЯДОК ОПЛАТЫ</h2>
    <p class="text">
      3.1. Использование Сервиса является для Пользователя бесплатным. При этом Пользователь при использовании Сервиса обязуется в установленном настоящей Офертой порядке оплачивать дополнительные услуги Агрегатора, размещенные в его предложении. Размер вознаграждения Агрегатора за такие дополнительные услуги определяется им самостоятельно и отображается Пользователю при заказе соответствующей услуги и / или озвучивается представителем Агрегатора.
      <br><br>
      3.2. Пользователь понимает и соглашается с тем, что оплата Заказа, реализуемого Исполнителем производится через Агрегатора путем перечисления ему денежных средств, а также с тем, что вышеуказанные платежи осуществляются исключительно в целях их дальнейшего перечисления Исполнителю и оплаты его услуг, за исключением удерживаемого Агрегатором с Исполнителя вознаграждения.
      <br><br>
      3.2.1. Вознаграждение Агрегатора не облагается НДС в связи с применением УСН согласно п. 2 ст. 346.11.
      <br><br>
      3.3. Платежи осуществляются способами, предусмотренными действующим законодательством Российской Федерации, путем перечисления денежных средств на расчетный счет Агрегатора, указанный в реквизитах настоящей Оферты, в том числе с использованием сторонних платежных систем, предусмотренных функционалом Сервиса.
      <br><br>
      3.4. Денежное обязательство, предусмотренное Офертой или возникшее из него, считается исполненным непосредственно с момента поступления денежных средств на расчетный счет Агрегатора.
      <br><br>
      3.5. Пользователь понимает и соглашается с тем, что любая оплата, произведенная по настоящему Договору считается конклюдентным действием, выражающим однозначное и бесспорное намерение исполнить акцептованный Договор. Наличие произведенной оплаты со стороны Пользователя или его представителя даже при отсутствии подписанной версии любого документа считается подтверждением воли на исполнение Договора.
      <br><br>
      3.6. Все банковские расходы по исполнению денежных обязательств по Договору Пользователь несет самостоятельно.

    </p>
    <br><br>

    <h2 class="title">4. ПРАВА И ОБЯЗАННОСТИ СТОРОН</h2>
    <p class="text">
      4.1. Агрегатор обязуется:
      <br><br>
      4.1.1. осуществлять консультационную поддержку относительно реализуемых Заказов по электронной почте Агрегатора и / или в предусмотренном функционалом Сайта чате с 10:00 до 17:00 по московскому времени по рабочим дням.
      <br><br>
      4.1.2. предоставлять Пользователю на Сервисе информацию о деятельности Исполнителей. 
      <br><br>
      4.2. Агрегатор имеет право:
      <br><br>
      4.2.1. отказаться от исполнения настоящего Договора и расторгнуть заключенный Договор в случае нарушения Пользователем обязательств, предусмотренных настоящей Офертой, направив Пользователю соответствующее уведомление. В случае такого отказа Договор будет считаться расторгнутым со дня, следующего за днем отправки Пользователю уведомления об отказе от Договора. 
      <br><br>
      4.2.2. в любое время изменить положения Оферты, а также сопутствующих документов. Пользователи уведомляются о прекращении действия или об изменении условий настоящего Положения путем опубликования соответствующей информации на Сайте. Условия считаются измененными и / или отмененными с момента, указанного в соответствующем уведомлении на Сайте. Риск неознакомления с новой редакцией Оферты и / или сопутствующих регулирующих документов несет Пользователь, продолжение пользования Сервисом после изменения Оферты и / или сопутствующих регулирующих документов считается согласием с их новой редакцией.
      <br><br>
      4.2.3. в одностороннем порядке приостановить или прекратить доступ Пользователя к Сервису, а также ограничить любые права на использование функционала Сервиса, включая блокировку или удаление записи Пользователя по любой причине на усмотрение Агрегатора. После наступления такого момента, Учетная запись и право на доступ к Сервису и его использование будут немедленно прекращено.
      <br><br>
      4.3. Пользователь обязуется:
      <br><br>
      4.3.1. самостоятельно и своевременно знакомиться со всеми условиями Оферты и сопутствующими регулирующими документами до момента оформления соответствующего Заказа. Пользователь несет самостоятельную ответственность за наступление (риск наступления) для него неблагоприятных последствий в связи с невыполнением обязанностей, указанных в настоящем пункте.
      <br><br>
      4.3.2. своевременно и в полном объеме вносить платежи, предусмотренные настоящей Офертой. 
      <br><br>
      4.3.3. незамедлительно уведомить Агрегатора об изменении своих контактных данных в письменной форме посредством контактного e-mail или посредством чата, предусмотренного функционалом Сайта.
      <br><br>
      4.3.4. предоставлять Агрегатору по запросу достоверные сведения и данные, необходимые для исполнения Договора.
      <br><br>
      4.4. Пользователь имеет право:
      <br><br>
      4.4.1. требовать от Агрегатора соблюдение условий настоящего Договора.
      <br><br>
      4.4.2. изменить или удалить любую информацию о себе, а также удалить свою учетную запись в Личном кабинете, направив со своей электронной почты письменное заявление по адресу электронной почты, указанному в реквизитах настоящей Оферты, либо направив письменное заявление на бумажном носителе по адресу корреспонденции Агрегатора. 
    </p>

    <br><br>

    <h2 class="title">5. ОТВЕТСТВЕННОСТЬ.</h2>
    <p class="text">
      5.1. В случаях неисполнения или ненадлежащего исполнения своих обязательств по Договору, Стороны несут ответственность в соответствии с законодательством РФ с учетом условий настоящей Оферты.
      <br><br>
      5.2. Агрегатор не несет ответственности в случае ненадлежащего исполнения настоящего Договора, если ненадлежащее исполнение явилось следствием недостоверности, недостаточности или несвоевременности предоставленных Пользователем сведений, а также вследствие других нарушений условий настоящего Договора со стороны Пользователя.
      <br><br>
      5.3. Пользователь понимает и соглашается с тем, что Агрегатор является исключительно связующим звеном между Пользователем и Исполнителем и не несёт ответственность за исполнение и / или ненадлежащее исполнение обязательств Исполнителем, связанных с исполнением Заказа Пользователя, так как Агрегатор обеспечивает взаимодействие Пользователя и Исполнителя, но не занимается оказанием соответствующих услуг. Агрегатор не отвечает за любые убытки Пользователя, возникшие в результате неправомерных действий третьих лиц, в том числе действий Исполнителя.
      <br><br>
      5.4. Правила настоящей Оферты предусматривают ограничение ответственности Агрегатора: ответственность Агрегатора в любом случае и за любое нарушение установленных настоящей офертой обязательств ограничена размером получаемого им вознаграждения в соответствии с настоящим Договором. В соответствии с регулированием, установленным ст. 15 Гражданского кодекса РФ возмещение убытков допускается исключительно в размере, который не превышает размер полученного Агрегатором вознаграждения.
      <br><br>
      5.5. В других случаях неисполнения или ненадлежащего исполнения своих обязательств по настоящей Оферте Пользователь и Агрегатор несут ответственность в соответствии с законодательством Российской Федерации с учетом условий Оферты.
    </p>

    <br><br>

    <h2 class="title">6. ОБСТОЯТЕЛЬСТВА ВНЕ КОНТРОЛЯ СТОРОН</h2>
    <p class="text">
      6.1. Стороны освобождаются от ответственности за неисполнение обязательств по Договору, если докажут, что неисполнение обусловлено обстоятельствами, находящимися вне контроля сторон. К обстоятельствам, находящимся вне контроля сторон относятся обстоятельства, которые делают невозможным исполнение обязательств по Договору, произошли после заключения Договора и не могли быть предвидены и предотвращены Сторонами в момент заключения Договора.
      <br><br>
      6.2. Освобождение от ответственности, предусмотренное настоящей статьей, распространяется лишь на время существования обстоятельств, указанных в пункте 6.1. Договора, и время необходимое для ликвидации последствий.
      <br><br>
      6.3.	Сторона, для которой наступили обстоятельства, указанные в пункте 6.1. Договора, обязана в кратчайший возможный срок уведомить другую Сторону о возникновении таких обстоятельств, а также о прекращении таких обстоятельств. Наличие обстоятельств подтверждается справкой, выданной Торгово-Промышленной палатой и / или иным уполномоченным органом.
      <br><br>
      6.4. В случае, если обстоятельства, предусмотренные п. 6.1. длятся больше 1 (одного) календарного месяца, Стороны обязаны путем проведения переговоров принять решение по дальнейшему исполнению или расторжению Договора.
    </p>
    <br><br>

    <h2 class="title">7. ПРИМЕНИМОЕ ПРАВО И РАЗРЕШЕНИЕ СПОРОВ</h2>

    <p class="text">
      7.1. Все споры, связанные с заключением, толкованием, исполнением и расторжением Договора, заключенного в ходе акцепта настоящей Оферты, будут разрешаться Сторонами путем переговоров.
      <br><br>
      7.2. Если в ходе переговоров соглашение не достигнуто, заинтересованная Сторона направляет претензию в письменной форме, подписанную уполномоченным лицом. 
      <br><br>
      7.3. Сторона, которой направлена претензия, обязана рассмотреть полученную претензию и о результатах уведомить в письменной форме заинтересованную Сторону в течение 30 (тридцати) календарных дней со дня получения претензии.
      <br><br>
      7.4. В случае не урегулирования разногласий в претензионном порядке, а также в случае неполучения ответа на претензию в течение срока, указанного в п. 7.3. Договора, спор передается в соответствующий суд по месту нахождения Агрегатора. 
    </p>
    <br><br>

    <h2 class="title">8. СРОК ДЕЙСТВИЯ И ПРЕКРАЩЕНИЕ ДЕЙСТВИЯ</h2>
     <p class="text">
      8.1. Срок действия настоящего Договора в отношении каждого Пользователя определяется на основании фактического использования таким Пользователем Сервиса Агрегатора. Пока Пользователь использует Сервис, на него распространяются все установленные настоящим Соглашением правила и обязательства. 
      <br><br>
      8.2. Агрегатор имеет право в одностороннем порядке приостановить оказание услуг и / или доступ к Сервису, а также отказаться от заключенного Договора в случае нарушения Пользователем предусмотренных настоящей Офертой обязательств. В такой ситуации внесенная Пользователем предоплата возвращается ему за вычетом вознаграждения Агрегатора.
     </p>
     <br><br>

    <h2 class="title">9. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ</h2>
    <p class="text">
      9.1. Настоящая Оферта подчиняется законодательству Российской Федерации и во всем что не урегулировано настоящей Офертой Стороны будут руководствоваться действующим законодательством Российской Федерации.
      <br><br>
      9.2. Признание судом какого-либо положения Оферты недействительным или не подлежащим принудительному исполнению не влечет недействительности иных положений Оферты.
      <br><br>
      9.3. Бездействие со стороны Агрегатора в случае нарушения кем-либо из Пользователей положений Оферты не лишает Агрегатора права предпринять позднее соответствующие действия в защиту своих интересов.
      <br><br>
      9.4. Стороны осуществляют обмен сообщений посредством электронной почты и мессенджеров с использованием соответствующих адресов. Стороны признают юридическую силу за электронным письмами, а также за сканами подписанных документов, отправленных по указанным ниже реквизитам и номерам. Такие сканы имеют силу оригинала до момента получения Стороной экземпляра на бумажном носителе.
      <br><br>
      9.5. Порядок обращения Пользователя к Агрегатору: все обращения должны направляться на адрес электронной почты info@delegat.online либо по адресу для переписки, указанному ниже.
    </p>
    
    <br><br>

    
    <h2 class="title">10. РЕКВИЗИТЫ АГРЕГАТОРА</h2>
    <p class="text">
      ООО «ДЕЛЕГАТ» <br>
      Юридический адрес: 123308, РОССИЯ, Г МОСКВА, УЛ 4-Я МАГИСТРАЛЬНАЯ, Д 11, ЭТ 5, КОМ 34,<br>
      ИНН 7714476990,<br>
      ОГРН 1217700470657<br>
      Банк АО "ТИНЬКОФФ БАНК",<br>
      К/с банка 30101810145250000974,<br>
      Р/с  40702810210000907656,<br>
      ИНН банка 7710140679<br>
      БИК банка 044525974<br>
      Юридический адрес банка: Москва, 127287, ул. Хуторская 2-я, д. 38А, стр. 26<br>
    </p>
    <br><br>

    <Transition name="up">
      <my-btn class="upBtn" @click="goUp" v-if="scroll > 1000">Наверх</my-btn>
    </Transition>
  </div>
</template>

<script setup>
import { onMounted, ref } from 'vue';
let scroll = ref(null);
onMounted(() => {
  window.addEventListener("scroll",() => {
    scroll.value = window.scrollY 
  })

  window.scrollTo(0 , 0)
})

const goUp = () => {
  window.scrollTo(0, 0)
}

</script>

<style scoped lang="scss">

.wrapper {
  @include flex(column, center, flex-start, 2rem);
  max-width: 70%;
  margin: 2rem auto;

  @media (max-width: 600px) {
    max-width: 90%;
    gap: 0;
  }
}
.subTitle {
  @include font (1.4rem, 600, $font-color2);
}

.title {
  @include title_h2;
}

.text {
  @include font (1.4rem, 500, $font-color2);
  text-align: left;
}

.text span {
  @include font (1.4rem, 600, $font-color2);
}


.upBtn {
  position: fixed;
  bottom: 10rem;
  left: 80%;
  width: 15rem ;

  @media (max-width: 600px) {
    bottom: 5rem;
    left: 60%;
  }
}

.up-enter-from {
  opacity: 0;
  transform: scale(0.5);
}
.up-leave-to {
  opacity: 0;
  transform: scale(0.5);
}

.up-enter-active,
.up-leave-active {
  transition: all 0.5s ease;
}
</style>